/* 这个API有详情，稍后再做 */
"use strict";
const http = require('http');
const url = require('url');
const util = require('util');
const superagent = require('superagent');
const open = require("open");

const appId = "82896f80be9bbad16df29eadf6a28a58";
let word = "李";  
let result = "";
let port = 8090;

const onRequest = (req,res) => {
	res.writeHead(200,{'Content-Type':'text/plain;charset=utf-8','Access-Control-Allow-Origin':"*"})

	let word = encodeURI(url.parse(req.url,true).query.word);
	console.log(word);
	superagent.get('http://v.juhe.cn/xhzd/query?key='+ appId +'&word=' + word).end((err,response) => {
			if(err) console.log(err);
			result = response.text;
	})
	res.write(result);
	res.end();
}


http.createServer(onRequest).listen(port);  
open(`http://localhost:${port}?word=${word}`);
console.log("Server Start!");


/*
{
    "reason": "返回成功", 
    "result": {
        "id": "4ca7c88ce76e9552", 
        "zi": "李", 
        "py": "li", 
        "wubi": "sbf", 
        "pinyin": "lǐ", 
        "bushou": "木", 
        "bihua": "7", 
        "jijie": [
            "李", 
            "lǐ", 
            "落叶小乔木，果实称“李子”，熟时呈黄色或紫红色，可食：李代桃僵（原用“桃”“李”共患难来喻兄弟相爱相助，后喻互相顶替或代他人受过）。投桃报李。李下不正冠（喻要避免不必要的嫌疑）。桃李不言，下自成蹊（喻为人只要忠诚、正直一定会感动别人）。", 
            "姓。", 
            "古同“理”，古代法官的代称。", 
            "", 
            "笔画数：7；", 
            "部首：木；", 
            "笔顺编号：1234521"
        ], 
        "xiangjie": [
            "李", 
            "lǐ", 
            "【名】", 
            "(形声。从木,子声。本义:李树)", 
            "同本义。落叶乔木,春天开白色花,果实叫李子,熟时黄色或紫红色,可吃〖plum〗", 
            "李,李果也。——《说文》", 
            "北山有李。——《诗·小雅·南山有台》", 
            "又如:李下瓜田(容易引起嫌疑的地方)。又指李树的果实、李花、李园", 
            "华如桃李。——《诗·召南·何彼禯矣》", 
            "(李:李花)", 
            "报之以李。——《诗·大雅·抑》", 
            "(李:李子)", 
            "丘中有李。——《诗·王风·丘中有麻》", 
            "(李:李园)", 
            "狱官。通“理”〖judge;justice〗", 
            "皋陶为李。——《管子·法法》", 
            "星名。即角宿二,为室女座δ星〖star'sname〗。如:李长庚(西方太白金星的名号)", 
            "姓。如:李杜(李白和杜甫);李唐(李氏唐朝);李氏子蟠(姓李的人家的孩子。氏,姓);李文靖公(李沆,字太初,宋太宗、真宗时的宰相,谥文靖);李渤(唐朝洛阳人,曾写过一篇《辨石钟山记》);李牧连却之,李牧接连打败它。李牧,赵国良将,曾几次打败秦军。公元前229年,秦将王翦攻赵,李牧率兵抵抗。赵王中了秦的反间计,杀李牧。第二年,王翦破赵军,虏赵王", 
            "", 
            "李白", 
            "LǐBái", 
            "〖LiBai〗(701—762)中国唐朝诗人。字太白,号青莲居士。绵州昌隆人(今四川江油)。才华横溢。诗歌今存900首。", 
            "李冰", 
            "LǐBīng", 
            "〖LiBin〗中国战国时水利家。他总结劳动人民的治水经验,征发民工在岷江流域兴办了许多水利工程,其中以都江堰最为著名,二千二百多年以来一直为川西平原提供了巨大的水利效益", 
            "李卜克内西", 
            "Lǐbǔkènèixī", 
            "〖liebknecht,Wilhelm〗(1826—1900)即威廉·李卜克内西。德国工人运动和国际工人运动的著名活动家,德国社会民主党的创立者和领袖之一;马克思和恩格斯的战友", 
            "李大钊", 
            "LǐDàzhāo", 
            "〖LiDazhao〗(1889—1927)字守常,河北省乐亭县人。中国早期的马克思主义理论家,中国共产党创始人令导人之一。1927年4月28日就义于北京", 
            "李代桃僵", 
            "lǐdàitáojiāng", 
            "〖substituteonethingforanother;substitutethisforthat〗古乐府《鸡鸣》:“桃生露井上,李树生桃傍。虫来啮桃根,李树代桃僵。”后来用“李代桃僵”比喻互相顶替或代人受过", 
            "李代桃僵,羊易牛死。——明·凌濛初《二刻拍案惊奇》", 
            "李公朴", 
            "LǐGōngpǔ", 
            "爱国民主人士,1946年7月11日因参加爱国民主运动,在昆明被国民党当局暗杀", 
            "李贺", 
            "LǐHè", 
            "〖LiHe〗(790—816)字长吉,唐代福昌(现在河南省宜阳西)人。南园,是李贺在家读书的地方。他写了《南园十三首》,慨叹当时有许多作品不切合实用,悲秋一类诗文用在战争中无济于事", 
            "李清照", 
            "LǐQīngzhào", 
            "〖LiQingzhao〗(1084—约1151)南宋女词人。号易安居士。济南(今山东济南)人。长于诗、文、词,兼书法、绘画,且通音律。诗文笔力雄健,情辞慷慨。词则继承婉约派风格,南渡前以造语新丽见称,南渡后以情调悲凉为主。所著《词论》,多有独立见解,对南唐二主以来词人遍加讥评,强调“词别是一家”,主张协律,崇尚典雅、情致。所著《易安居士文集》、《易安词》已佚;后人辑有《漱玉词》;今人辑有《李清照集》", 
            "李商隐", 
            "LǐShāngyǐn", 
            "〖LiShangyin〗(约813—858)唐诗人。字义山,号玉谿生,怀州河内(今河南沁阳县)人。曾任校书郎、弘农尉、秘书省正字等职。有《玉谿生诗》,现存;文集已佚,后人辑有《樊南文集》、《樊南文集补编》。李商隐与杜牧齐名,人称“小李杜”,以别于李白和杜甫。又与温庭筠齐名,称为“温李”。“身无彩凤双飞翼,心有灵犀一点通”、“春蚕到死丝方尽,蜡炬成灰泪始干”,均为千古传诵的名句。李商隐的诗继承和发展了我国古典诗歌的艺术技巧,成就很高", 
            "李时珍", 
            "LǐShízhēn", 
            "〖LiShizhen〗(1518—1593)中国明代医药学家。字东璧,号濒湖,蕲州(今湖北蕲春)人。著有《本草纲目》。收录原有诸家《本草》所载药物共一千五百十八种,新增药物三百七十四种。总结了十六世纪以前中国劳动人民丰富的药物经验,对后世药物学的发展作出重大贡献", 
            "李渔", 
            "LǐYú", 
            "〖LiYu〗(1611—约1680)字笠鸿、谪凡,号笠翁,明末清初兰溪(现在浙江省兰溪县)人,戏曲理论家,作家。除《一家言》外,还著有《笠翁十种曲》(传奇)、短篇小说集《十二楼》等", 
            "李煜", 
            "LǐYù", 
            "〖LiYu〗(937—978)字重光,南唐后主。公元975年,宋灭南唐,他被封为“违命侯”,过了三年阶下囚的生活,终被杀死"
        ]
    }, 
    "error_code": 0
}
*/