/* 这个API有详情，稍后再做 */
"use strict";
const http = require('http');
const url = require('url');
const util = require('util');
const superagent = require('superagent');
const open = require("open");

const appId = "249733dc442c8b65ec1947efffb33e8f";
let subject = "1";  //选择考试科目类型，1：科目1；4：科目4
let model = 'c1';   //	驾照类型，可选择参数为：c1,c2,a1,a2,b1,b2；当subject=4时可省略
let result = "";
let port = 8090;

const onRequest = (req,res) => {
	res.writeHead(200,{'Content-Type':'text/plain;charset=utf-8','Access-Control-Allow-Origin':"*"})

	let subject = encodeURI(url.parse(req.url,true).query.subject);
	let model = encodeURI(url.parse(req.url,true).query.model);
	console.log(subject,model);
	superagent.get('http://api2.juheapi.com/jztk/query?subject='+ subject +'&model='+ model +'&key=' + appId + '&testType=rand').end((err,response) => {
			if(err) console.log(err);
			result = response.text;
	})
	res.write(result);
	res.end();
}


http.createServer(onRequest).listen(port);  
open(`http://localhost:${port}?subject=${subject}&model=${model}`);
console.log("Server Start!");

/*
{
  "error_code": 0,
  "reason": "ok",
  "result": [
    {
      "id": 1,
      "question": "这个标志是何含义？",
      "answer": "4",
      "item1": "小型车车道",
      "item2": "小型车专用车道",
      "item3": "多乘员车辆专用车道",
      "item4": "机动车车道",
      "explains": "此为机动车车道，比多乘员车辆专用车道少俩人。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/1.jpg"
    },
    {
      "id": 30,
      "question": "这个标志是何含义？",
      "answer": "2",
      "item1": "十字交叉路口预告",
      "item2": "互通式立体交叉预告",
      "item3": "Y型交叉路口预告",
      "item4": "环行交叉路口预告",
      "explains": "互通式立体交叉：路线交叉中的一种重要类型。交叉道路之间立体交叉并以匝道相互连通以实现交通转换的交叉。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/30.jpg"
    },
    {
      "id": 31,
      "question": "这个标志是何含义？",
      "answer": "2",
      "item1": "右侧是下坡路段",
      "item2": "靠右侧道路行驶",
      "item3": "靠道路右侧停车",
      "item4": "只准向右转弯",
      "explains": "靠右侧道路行驶：表示只准一切车辆靠右侧道路行驶。此标志设在车辆必须靠右侧行驶的路口以前适当位置。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/31.jpg"
    },
    {
      "id": 35,
      "question": "这个标志是何含义？",
      "answer": "2",
      "item1": "禁止直行和向左变道",
      "item2": "禁止直行和向左转弯",
      "item3": "允许直行和向左变道",
      "item4": "禁止直行和向右转弯",
      "explains": "禁止直行和向左转弯：表示前方路口禁止一切车辆直行和向左转弯。此标志设在禁止直行和向左转弯的路口前适当位置。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/35.jpg"
    },
    {
      "id": 36,
      "question": "这个标志是何含义？",
      "answer": "1",
      "item1": "观景台",
      "item2": "停车场",
      "item3": "休息区",
      "item4": "停车位",
      "explains": "观景台那三个字多明显，你再不选它，叫它情何以堪。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/36.jpg"
    },
    {
      "id": 51,
      "question": "这个标志是何含义？",
      "answer": "2",
      "item1": "两侧通行",
      "item2": "右侧通行",
      "item3": "左侧通行",
      "item4": "不准通行",
      "explains": "用于引导行车方向，提示道路使用者前方线形变化，注意谨慎驾驶。设于中央隔离设施端部、渠化设施的端部、桥头等。答题技巧：∧表示俩侧通行，/这个方向的表示左侧通行，这个方向表示右侧通行。交通指路标志大全：http://www.jszks.com/onepage/16752.html",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/51.jpg"
    },
    {
      "id": 81,
      "question": "这个标志是何含义？",
      "answer": "4",
      "item1": "高速公路救援电话号码",
      "item2": "高速公路服务电话号码",
      "item3": "高速公路报警电话号码",
      "item4": "高速公路交通广播频率",
      "explains": "高速公路交通广播频率：用以指示收听高速公路或城市快速路交通信息广播的频率，可在适当地点设置，根据需要可重复设置。查看高速公路标志大全：http://www.jszks.com/onepage/16721.html",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/81.jpg"
    },
    {
      "id": 89,
      "question": "路缘石上的黄色实线是何含义？",
      "answer": "4",
      "item1": "仅允许上下人员",
      "item2": "仅允许装卸货物",
      "item3": "禁止长时间停车",
      "item4": "禁止停放车辆",
      "explains": "好人记住吧",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/89.jpg"
    },
    {
      "id": 94,
      "question": "指示标线的作用是什么？",
      "answer": "2",
      "item1": "禁止通行",
      "item2": "指示通行",
      "item3": "限制通行",
      "item4": "警告提醒",
      "explains": "指示标线主要就是引导你正确的行驶，安全守法",
      "url": ""
    },
    {
      "id": 100,
      "question": "这个地面标记是什么标线？",
      "answer": "1",
      "item1": "人行横道预告",
      "item2": "交叉路口预告",
      "item3": "减速让行预告",
      "item4": "停车让行预告",
      "explains": "这种标线在到达人行横道前的道路30-50米处设置，它的作用是用来提示驾驶员，前方已接近人行横道，应减速慢行，并须注意行人横过马路",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/100.jpg"
    },
    {
      "id": 117,
      "question": "图中圈内的白色折线是什么标线？",
      "answer": "1",
      "item1": "车距确认线",
      "item2": "减速行驶线",
      "item3": "车速确认线",
      "item4": "路口减速线",
      "explains": "车距确认标线作为车辆驾驶人保持行车安全距离的参考，视需要设于较长直线段、易发生追尾事故或其他需要的路段，应与车距确认标志配合使用。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/117.jpg"
    },
    {
      "id": 120,
      "question": "水淹路面影响行车安全，不易通行的原因是什么？",
      "answer": "2",
      "item1": "路面附着力增大",
      "item2": "无法观察到暗坑和凸起的路面",
      "item3": "能见度低，视野模糊",
      "item4": "日光反射阻挡视线",
      "explains": "因为水淹没了路面，所以看不清是暗坑和凸起的路面",
      "url": ""
    },
    {
      "id": 130,
      "question": "这一组交通警察手势是什么信号？",
      "answer": "4",
      "item1": "减速慢行信号",
      "item2": "靠边停车信号",
      "item3": "停止信号",
      "item4": "右转弯信号",
      "explains": "手势题详解：http://www.jszks.com/onepage/16203.html",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/130.jpg"
    },
    {
      "id": 146,
      "question": "这个标志是何含义？",
      "answer": "1",
      "item1": "避险车道",
      "item2": "应急车道",
      "item3": "路肩",
      "item4": "急弯道",
      "explains": "避险车道是指在长陡下坡路段行车道外侧增设的供速度失控车辆驶离正线安全减速的专用车道。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/146.jpg"
    },
    {
      "id": 186,
      "question": "驾驶机动车要选择绿色箭头灯亮的车道行驶。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "绿灯行，没有问题。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/186.jpg"
    },
    {
      "id": 190,
      "question": "在这条车道行驶的最低车速是多少？",
      "answer": "4",
      "item1": "100公里/小时",
      "item2": "110公里/小时",
      "item3": "60公里/小时",
      "item4": "90公里/小时",
      "explains": "高速路同方向有3条车道，最左侧的为110公里到120公里，中间的为90公里到110公里，最右侧的速度范围为60公里到90公里。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/190.jpg"
    },
    {
      "id": 200,
      "question": "驾驶人在道路上醉酒驾驶机动车的处3年以上有期徒刑。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "醉酒驾驶，由公安机关约束至酒醒。吊销机驾驶证，依法追究刑事责任，5年内不得重新取得驾驶证。",
      "url": ""
    },
    {
      "id": 213,
      "question": "可以从这个位置直接驶入高速公路行车道。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "应该按照标线行驶，不要乱开。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/213.jpg"
    },
    {
      "id": 230,
      "question": "在标志、标线齐全的高速公路上行车，应当按照什么规定的车道和车速行驶？",
      "answer": "1",
      "item1": "标志或标线",
      "item2": "《道路交通安全法》",
      "item3": "车辆说明书",
      "item4": "地方法规",
      "explains": "题目这么强调“标志、标线”，你再不选A，你让A情何以堪。",
      "url": ""
    },
    {
      "id": 236,
      "question": "行车中发现前方道路拥堵时，应怎样做？",
      "answer": "3",
      "item1": "寻找机会超越前车",
      "item2": "从车辆空间穿插通过",
      "item3": "减速停车，依次排队等候",
      "item4": "鸣喇叭催促",
      "explains": "基于和谐第一位，一定要减速停车依次排队。",
      "url": ""
    },
    {
      "id": 272,
      "question": "驾驶车辆在道路上行驶时，应当按照规定的速度安全行驶。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "注意“安全行驶”四个字。有安全两个字就不会错了",
      "url": ""
    },
    {
      "id": 282,
      "question": "同车道行驶的车辆遇前车有下列哪种情形时不得超车？",
      "answer": "3",
      "item1": "正在停车",
      "item2": "减速让行",
      "item3": "正在掉头",
      "item4": "正常行驶",
      "explains": "同车道行驶的机动车，后车应当与前车保持足以采取紧急制动措施的安全距离。有下列情形之一的，不得超车：  ①《《前车正在左转弯、掉头、超车的》》;  ②与对面来车有会车可能的;  ③前车为执行紧急任务的警车、消防车、救护车、工程救险车的;  ④行经铁路道口、交叉路口、窄桥、弯道、陡坡、隧道、人行横道、市区交通流量大的路段等没有超车条件的。",
      "url": ""
    },
    {
      "id": 290,
      "question": "行车中遇列队横过道路的学生时，应怎样做？",
      "answer": "2",
      "item1": "提前加速抢行",
      "item2": "停车让行",
      "item3": "降低车速、缓慢通过",
      "item4": "连续鸣喇叭催促",
      "explains": "祖国的未来啊，不让公务车也要让祖国的未来。",
      "url": ""
    },
    {
      "id": 300,
      "question": "距离桥梁、陡坡、隧道50米以内的路段不能停车。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "《中华人民共和国道路交通安全法实施条例》第六十三条 机动车在道路上临时停车，应当遵守下列规定：　　（二）交叉路口、铁路道口、急弯路、宽度不足４米的窄路、桥梁、陡坡、隧道以及距离上述地点５０米以内的路段，不得停车；",
      "url": ""
    },
    {
      "id": 301,
      "question": "驾驶车辆在交叉路口前变更车道时，应怎样驶入要变更的车道？",
      "answer": "4",
      "item1": "在路口前实线区内根据需要",
      "item2": "进入路口实线区内",
      "item3": "在路口停止线前",
      "item4": "在虚线区按导向箭头指示",
      "explains": "当然是在未到人行道前按导向标识了，要不都到人行道边上了，怎么改变车道。",
      "url": ""
    },
    {
      "id": 306,
      "question": "打开机动车车门时，不得妨碍其他车辆和行人通行。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "这个没有问题。",
      "url": ""
    },
    {
      "id": 331,
      "question": "驾驶人有使用其他车辆检验合格标志嫌疑的，交通警察可依法扣留车辆。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "交通警察可依法扣留 车辆，等他们查清楚车的来由，当场教导让其车在指定时间内接受车辆检验并放行。",
      "url": ""
    },
    {
      "id": 335,
      "question": "道路交通违法行为累积记分周期是多长时间？",
      "answer": "2",
      "item1": "14个月",
      "item2": "12个月",
      "item3": "6个月",
      "item4": "10个月",
      "explains": "常识题，积分周期为一年",
      "url": ""
    },
    {
      "id": 336,
      "question": "驾驶人有使用其他车辆号牌、行驶证嫌疑的，交通警察可依法扣留车辆。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "这个规定是可以的。万一是犯罪的车辆所以可以扣留车辆。",
      "url": ""
    },
    {
      "id": 362,
      "question": "车辆在路边起步后应尽快提速，并向左迅速转向驶入正常行驶道路。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "你要先观察阿！安全了你再开过去阿！不是一起步就迅速的往正常行驶道行驶，万一后面有车怎么办呢？ 所以“迅速”是错的",
      "url": ""
    },
    {
      "id": 409,
      "question": "在这条车道行驶的最高车速是多少？",
      "answer": "2",
      "item1": "100公里/小时",
      "item2": "90公里/小时",
      "item3": "120公里/小时",
      "item4": "110公里/小时",
      "explains": "右边那个牌子就是告诉你最高时速是90公里/小时，安标志行驶。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/409.jpg"
    },
    {
      "id": 413,
      "question": "驾驶人出现下列哪种情况，不得驾驶机动车？",
      "answer": "3",
      "item1": "记分达到10分",
      "item2": "记分达到6分",
      "item3": "驾驶证丢失、损毁",
      "item4": "驾驶证接近有效期",
      "explains": "驾驶证丢失、损毁的算是没有驾驶证，此时驾驶就是无证驾驶。",
      "url": ""
    },
    {
      "id": 423,
      "question": "行经这种交通标线的路段要加速行驶。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "要减速通过，看到那个白色的菱形没，那是人行横道预告，所以要减速防止撞到行人。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/423.jpg"
    },
    {
      "id": 436,
      "question": "有下列哪种违法行为的机动车驾驶人将被一次记6分？",
      "answer": "1",
      "item1": "驾驶机动车违反道路交通信号灯",
      "item2": "未取得校车驾驶资格驾驶校车",
      "item3": "驾驶与准驾车型不符的机动车",
      "item4": "饮酒后驾驶机动车",
      "explains": "闯灯的一次6分。B,C,D都是一次记12分。",
      "url": ""
    },
    {
      "id": 439,
      "question": "驾驶机动车通过没有交通信号的交叉路口怎样行驶？",
      "answer": "1",
      "item1": "减速慢行",
      "item2": "加速通过",
      "item3": "大型车先行",
      "item4": "左侧车辆先行",
      "explains": "减速慢行并且观察路况，搞不好哪里飞出辆车来。",
      "url": ""
    },
    {
      "id": 469,
      "question": "这是什么踏板？",
      "answer": "1",
      "item1": "加速踏板",
      "item2": "离合器踏板",
      "item3": "驻车制动器",
      "item4": "制动踏板",
      "explains": "加速踏板俗称油门，控制车速的。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/469.jpg"
    },
    {
      "id": 480,
      "question": "上路行驶的机动车未随车携带身份证的，交通警察可依法扣留机动车。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "上路行驶的机动车未随车携带机动车行驶证的，交通警察可依法扣留机动车。",
      "url": ""
    },
    {
      "id": 488,
      "question": "拼装的机动车只要认为安全就可以上路行驶。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "机动车不跟电脑一样可以拼装，机动车都是品牌的不能动的。",
      "url": ""
    },
    {
      "id": 490,
      "question": "未取得驾驶证的学员在道路上学习驾驶技能，下列哪种做法是正确的？",
      "answer": "1",
      "item1": "使用所学车型的教练车由教练员随车指导",
      "item2": "使用所学车型的教练车单独驾驶学习",
      "item3": "使用所学车型的教练车由非教练员的驾驶人随车指导",
      "item4": "使用私家车由教练员随车指导",
      "explains": "规定：未取得驾驶证的学员在道路上学习驾驶技能，使用所学车型的教练车由教练员随车指导。",
      "url": ""
    },
    {
      "id": 499,
      "question": "夜间驾驶人对事物的观察能力明显比白天差，视距变短。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "此题说的意思是，你在白天开车的时候由于光线比较充足，所以观察事物的范围比较广，观察事物的视线距离相对也就比较大，而在晚上受到光线暗的局限，相对观察事物的距离也就受到局限，所以视距比较短，而并不是说人本身的观察有问题，所以此题是正确的！",
      "url": ""
    },
    {
      "id": 507,
      "question": "驾驶机动车在道路上违反道路交通安全法的行为，属于什么行为？",
      "answer": "4",
      "item1": "过失行为",
      "item2": "违规行为",
      "item3": "违章行为",
      "item4": "违法行为",
      "explains": "现在都是违法行为，没有违规行为和违章行为一说。",
      "url": ""
    },
    {
      "id": 532,
      "question": "机动车驾驶人造成事故后逃逸构成犯罪的，吊销驾驶证且多长时间不得重新取得驾驶证？",
      "answer": "4",
      "item1": "5年内",
      "item2": "10年内",
      "item3": "20年内",
      "item4": "终生",
      "explains": "吊二撤三醉五逃终生，这样就好理解了吧！",
      "url": ""
    },
    {
      "id": 540,
      "question": "风、雨、雪、雾等复杂气象条件，遇前车速度较低时，应开启前照灯，连续鸣喇叭迅速超越。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "风、雨、雪、雾，都要减速了，你还要超车。安全第一！",
      "url": ""
    },
    {
      "id": 579,
      "question": "怎样通过这样的路口？",
      "answer": "4",
      "item1": "不减速通过",
      "item2": "加速尽快通过",
      "item3": "空挡滑行通过",
      "item4": "减速或停车观察",
      "explains": "右侧为无人看守的铁路标志，既然是无人看守，您就得悠着点，减速或停车观察一下吧。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/579.jpg"
    },
    {
      "id": 581,
      "question": "如图所示，在这种情况下只要后方没有来车，可以倒车。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "箭头框子是矩形，表示单行路；单行道是不准倒车的。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/581.jpg"
    },
    {
      "id": 583,
      "question": "驾驶人在机动车驾驶证的6年有效期内，每个记分周期均未达到12分的，换发10年有效期的机动车驾驶证。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "123号令第四十七条  机动车驾驶人在机动车驾驶证的六年有效期内，每个记分周期均未记满12分的，换发十年有效期的机动车驾驶证；在机动车驾驶证的十年有效期内，每个记分周期均未记满12分的，换发长期有效的机动车驾驶证。",
      "url": ""
    },
    {
      "id": 598,
      "question": "机动车仪表板上（如图所示）亮表示什么？",
      "answer": "2",
      "item1": "空气内循环",
      "item2": "空气外循环",
      "item3": "迎面吹风",
      "item4": "风窗玻璃除霜",
      "explains": "此为空气外循环，当箭头在车内转的时候是空气内循环。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/598.jpeg"
    },
    {
      "id": 600,
      "question": "在行驶过程中，机动车驾驶人要注意与前车保持安全距离。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "追尾都是后车责任，因为没有足够的安全距离。",
      "url": ""
    },
    {
      "id": 609,
      "question": "驾驶机动车正在被其他车辆超越时，被超车辆减速靠右侧行驶的目的是什么?",
      "answer": "2",
      "item1": "以便随时停车",
      "item2": "给该车让出足够的超车空间",
      "item3": "避让行人与非机动车",
      "item4": "提醒其他交通参与者注意避让",
      "explains": "\"《道路交通安全法实施条例》第四十七条：机动车超车时，应当提前开启左转向灯、变换使用远、近光灯或者鸣喇叭。在没有道路中心线或者同方向只有1条机动车道的道路上，前车遇后车发出超车信号时，在条件许可的情况下，应当降低速度、靠右让路。后车应当在确认有充足的安全距离后，从前车的左侧超越，在与被超车辆拉开必要的安全距离后，开启右转向灯，驶回原车道。\"",
      "url": ""
    },
    {
      "id": 625,
      "question": "人行横道上禁止掉头的原因是什么？",
      "answer": "4",
      "item1": "路段有监控设备",
      "item2": "人行横道禁止停车",
      "item3": "人行横道禁止车辆通行",
      "item4": "避免妨碍行人正常通行，确保行人安全",
      "explains": "人行横道禁止掉头。虽然设有交通隔离护栏路段的人行横道不设禁止掉头交通标志，但规定严禁在人行横道掉头，这主要是为了保护人行横道上行人的安全。因为行人具有优先通行权，人行横道就视同“禁止性标志”。",
      "url": ""
    },
    {
      "id": 644,
      "question": "公安机关交通管理部门对累积记分达到规定分值的驾驶人怎样处理？",
      "answer": "3",
      "item1": "处15日以下拘留",
      "item2": "终生禁驾",
      "item3": "进行法律法规教育，重新考试",
      "item4": "依法追究刑事责任",
      "explains": "满12分了你就重新去学习一下吧，再来金手指重新回锅一下。",
      "url": ""
    },
    {
      "id": 653,
      "question": "机动车驾驶人补领机动车驾驶证后，原机动车驾驶证作废，不得继续使用。",
      "answer": "1",
      "item1": "",
      "item2": "",
      "item3": "",
      "item4": "",
      "explains": "《机动车驾驶证申领和使用规定》机动车驾驶人补领机动车驾驶证后，原机动车驾驶证作废，不得继续使用。",
      "url": ""
    },
    {
      "id": 663,
      "question": "驾驶机动车在雾天行车开启雾灯和危险报警闪光灯。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "《中华人民共和国道路交通安全法实施条例》第五十八条 机动车在夜间没有路灯、照明不良或者遇有雾、雨、雪、沙尘、冰雹等低能见度情况下行驶时，应当开启前照灯、示廓灯和后位灯，但同方向行驶的后车与前车近距离行驶时，不得使用远光灯。\u003cb\u003e机动车雾天行驶应当开启雾灯和危险报警闪光灯\u003c/b\u003e。",
      "url": ""
    },
    {
      "id": 675,
      "question": "如图所示，在这种情况下跟车行驶，不能使用远光灯的原因是什么？",
      "answer": "3",
      "item1": "不利于看清远方的路况",
      "item2": "不利于看清车前的路况",
      "item3": "会影响前车驾驶人的视线",
      "item4": "会影响自己的视线",
      "explains": "当开启远光灯之后，由于远光灯的光束十分集中且亮度较高，前车的司机在看左右后视镜时，往往会受刺眼的强光影响，形成局部的“盲区”甚至短暂“失明”，无法看清车身两侧的路面情况。尤其在需要并线或者转弯时，一个不留神就极其容易发生交通意外。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/675.jpg"
    },
    {
      "id": 676,
      "question": "申请人有下列哪种行为，三年内不得再次申领机动车驾驶证？",
      "answer": "3",
      "item1": "实习期记满12分，注销驾驶证的",
      "item2": "申请人在考试过程中有舞弊行为的",
      "item3": "申请人以欺骗、贿赂等不正当手段取得机动车驾驶证的",
      "item4": "申请人未能在培训过程中认真练习的",
      "explains": "《机动车驾驶证申领和使用规定》第十二条有下列情形之一的，不得申请机动车驾驶证:(一)有器质性心脏病、癫痫病、美尼尔氏症、眩晕症、癔病、震颤麻痹、精神病、痴呆以及影响肢体活动的神经系统疾病等妨碍安全驾驶疾病的;(二)三年内有吸食、注射毒品行为或者解除强制隔离戒毒措施未满三年，或者长期服用依赖性精神药品成瘾尚未戒除的;(三)造成交通事故后逃逸构成犯罪的;（四）申请人以欺骗、贿赂等不正当手段取得机动车驾驶证的；(五)醉酒驾驶营运机动车依法被吊销机动车驾驶证未满十年的。",
      "url": ""
    },
    {
      "id": 701,
      "question": "专用车道规定的专用使用时间之外，其他车辆可以进入专用车道行驶。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "当然啦，在规定的时间内，给专用车行驶时，咱不可以乱入；规定的时间以为，可以光明正大的行驶哦！",
      "url": ""
    },
    {
      "id": 709,
      "question": "如图所示，驾驶机动车接打电话容易导致发生交通事故。",
      "answer": "1",
      "item1": "",
      "item2": "",
      "item3": "",
      "item4": "",
      "explains": "驾驶机动车接打电话会分散驾驶员的注意力，容易导致发生交通事故。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/709.jpg"
    },
    {
      "id": 721,
      "question": "已注册登记的机动车达到国家规定的强制报废标准的，应当向登记地车辆管理所申请注销登记。",
      "answer": "1",
      "item1": "",
      "item2": "",
      "item3": "",
      "item4": "",
      "explains": "《中华人民共和国道路交通安全法》第二章第十四条规定:应当报废的机动车必须及时办理注销登记。达到报废标准的机动车不得上道路行驶。报废的大型客、货车及其他营运车辆应当在公安机关交通管理部门的监督下解体。",
      "url": ""
    },
    {
      "id": 741,
      "question": "机动车仪表板上（如图所示）亮表示什么？",
      "answer": "1",
      "item1": "地板及迎面出风",
      "item2": "空气内循环",
      "item3": "空气外循环",
      "item4": "侧面及地板出风",
      "explains": "亲，这个真的选A。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/741.jpeg"
    },
    {
      "id": 753,
      "question": "在这个路口怎样左转弯？",
      "answer": "2",
      "item1": "靠路口中心点右侧转弯",
      "item2": "靠路口中心点左侧转弯",
      "item3": "骑路口中心点转弯",
      "item4": "不能左转弯",
      "explains": "这个是规定，左转要靠路口中心点左侧转弯。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/753.jpg"
    },
    {
      "id": 786,
      "question": "驾驶人户籍迁出原车辆管理所需要向什么地方的车辆管理所提出申请？",
      "answer": "4",
      "item1": "迁出地",
      "item2": "居住地",
      "item3": "所在地",
      "item4": "迁入地",
      "explains": "《公安部令第123号》第四十九条：机动车驾驶人户籍迁出原车辆管理所管辖区的，应当向迁入地车辆管理所申请换证。",
      "url": ""
    },
    {
      "id": 787,
      "question": "道路上划设这种标线的车道内允许下列哪类车辆通行？",
      "answer": "1",
      "item1": "公交车",
      "item2": "私家车",
      "item3": "出租车",
      "item4": "公务用车",
      "explains": "看见上边的大字没，公交专用车道，你在不选A，你选谁。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/787.jpg"
    },
    {
      "id": 788,
      "question": "驾驶机动车通过未设置交通信号灯的交叉路口时，下列说法错误的是什么？",
      "answer": "4",
      "item1": "转弯的机动车让直行的车辆、行人先行",
      "item2": "没有交通标志、标线控制时，在进入路口前停�望，让右方道路的来车先行",
      "item3": "相对方向行驶的右转弯机动车让左转弯的车辆先行",
      "item4": "相对方向行驶的左转弯机动车让右转弯的车辆先行",
      "explains": "驾驶机动车通过未设置交通信号灯的交叉路口时，转弯的机动车应当让直行的车辆、行人先行；没有交通标志、标线控制时，在进入路口前停车�望，让右方道路的来车先行；相对方向行驶的右转弯机动车让左转弯的车辆先行。",
      "url": ""
    },
    {
      "id": 791,
      "question": "前方路口这种信号灯亮表示什么意思？",
      "answer": "3",
      "item1": "加速左转",
      "item2": "禁止右转",
      "item3": "路口警示",
      "item4": "加速直行",
      "explains": "黄灯为警示灯，所以是路口警示。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/791.jpg"
    },
    {
      "id": 793,
      "question": "这个标志的含义是提醒车辆驾驶人前方是桥头跳车较严重的路段。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "驼峰桥：用以提醒车辆驾驶人谨慎驾驶。设在拱度很大，影响视距的驼峰桥以前适当位置。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/793.jpg"
    },
    {
      "id": 825,
      "question": "如图所示，在高速公路最左侧车道行驶，想驶离高速公路，以下说法正确的是什么？",
      "answer": "3",
      "item1": "立即减速后右变更车道",
      "item2": "找准机会一次变更到最右侧车道",
      "item3": "每次变更一条车道，直到最右侧车道",
      "item4": "为了快速变更车道，可以加速超越右侧车辆后变更车道",
      "explains": "变更车道，每次只能变更一条车道，变更之后需行驶一段距离，再变道。不可以连续变更车道。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/825.jpg"
    },
    {
      "id": 837,
      "question": "这个标志的含义是警告车辆驾驶人注意前方设有信号灯。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "注意信号灯：用以警告车辆驾驶人注意前方路段设有信号灯，应依信号灯指示行车。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/837.jpg"
    },
    {
      "id": 852,
      "question": "公安机关交通管理部门对驾驶人的交通违法行为除依法给予行政处罚外,实行下列哪种制度？",
      "answer": "3",
      "item1": "违法登记制度",
      "item2": "奖励里程制度",
      "item3": "累积记分制度",
      "item4": "强制报废制度",
      "explains": "《道路交通安全法》第二十四条：公安机关交通管理部门对机动车驾驶人违反道路交通安全法律、法规的行为，除依法给予行政处罚外，实行累积记分制度。",
      "url": ""
    },
    {
      "id": 869,
      "question": "这个标志是何含义？",
      "answer": "4",
      "item1": "两侧变窄路段",
      "item2": "车速测试路段",
      "item3": "车距确认路段",
      "item4": "注意保持车距",
      "explains": "车距确认标线作为车辆驾驶人保持行车安全距离的参考，视需要设于较长直线段、易发生追尾事故或其他需要的路段，应与车距确认标志配合使用。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/869.jpg"
    },
    {
      "id": 886,
      "question": "如图所示，驾驶机动车在路口遇到这种交通信号时，右转弯的车辆在不妨碍被放行的车辆、行人的情况下，可以通行。",
      "answer": "1",
      "item1": "",
      "item2": "",
      "item3": "",
      "item4": "",
      "explains": "驾驶机动车在路口遇到这种交通信号时，右转弯的车辆在不妨碍被放行的车辆、行人的情况下，可以通行。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/886.jpg"
    },
    {
      "id": 907,
      "question": "道路没有划分机动车道、非机动车道和人行道的，以下说法正确的是什么？",
      "answer": "3",
      "item1": "机动车在道路左侧通行，非机动车和行人随意通行",
      "item2": "机动车在道路左侧通行，非机动车和行人在道路两侧通行",
      "item3": "机动车在道路中间通行，非机动车和行人在道路两侧通行",
      "item4": "机动车、非机动车和行人可随意通行",
      "explains": "驾驶机动车经过无划分车道的道路时，机动车在道路中间通行，非机动车和行人在道路两侧通行。",
      "url": ""
    },
    {
      "id": 908,
      "question": "驾驶机动车在高速公路上行驶，遇低能见度气象条件时，能见度在200米以下，车速不得超过每小时多少公里，与同车道前车至少保持多少米的距离？",
      "answer": "1",
      "item1": "60，100",
      "item2": "70，100",
      "item3": "40，80",
      "item4": "30，80",
      "explains": "驾驶机动车在高速公路上行驶，遇低能见度气象条件时，能见度在200米以下，车速不得超过60公里/小时，与同车道前车至少保持100米的车距以保证安全。",
      "url": ""
    },
    {
      "id": 914,
      "question": "如图所示，驾驶机动车遇到这种情况时，以下做法正确的是什么？ ",
      "answer": "2",
      "item1": "应减速观察水情，然后加速行驶通过",
      "item2": "应停车察明水情，确认安全后，低速通过",
      "item3": "应停车察明水情，确认安全后，快速通过",
      "item4": "可随意通行",
      "explains": "机动车在有积水较深的桥下通过行车时，应当停车察明水情，确认安全后，低速通过。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/914.jpg"
    },
    {
      "id": 920,
      "question": "这个标志是何含义？",
      "answer": "3",
      "item1": "施工路段绕行",
      "item2": "双向交通",
      "item3": "左右绕行",
      "item4": "注意危险",
      "explains": "左右绕行：用以告示前方道路有障碍物，车辆应按标志指示减速慢行，绕行通过。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/920.jpg"
    },
    {
      "id": 927,
      "question": "驾驶机动车超车时，被超越车辆未减速让路，应迅速提速超越前方车辆完成超车。",
      "answer": "2",
      "item1": "",
      "item2": "",
      "item3": "",
      "item4": "",
      "explains": "驾驶机动车超车时，被超越车辆未减速让路，应停止超车。",
      "url": ""
    },
    {
      "id": 928,
      "question": "隐瞒有关情况或者提供虚假材料申请机动车驾驶证，申请人在多少年内不得再次申领机动车驾驶证？",
      "answer": "1",
      "item1": "1年",
      "item2": "2年",
      "item3": "3年",
      "item4": "4年",
      "explains": "机动车驾驶证申领和使用规定》第六章，法律责任，第七十八条隐瞒有关情况或者提供虚假材料申领机动车驾驶证的，申请人在一年内不得再次申领机动车驾驶证。",
      "url": ""
    },
    {
      "id": 939,
      "question": "使用伪造、变造的驾驶证一次记12分。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "使用伪造、变造的机动车号牌、行驶证、驾驶证、校车标牌或者使用其他机动车号牌、行驶证的一次记12分。",
      "url": ""
    },
    {
      "id": 940,
      "question": "驾驶拼装的机动车上道路行驶的，公安机关交通管理部门应当予以收缴，强制报废，并吊销机动车驾驶证。",
      "answer": "1",
      "item1": "",
      "item2": "",
      "item3": "",
      "item4": "",
      "explains": "驾驶拼装的机动车或者已达到报废标准的机动车上道路行驶的，公安机关交通管理部门应当予以收缴，强制报废。对驾驶前款所列机动车上道路行驶的驾驶人，处二百元以上二千元以下罚款，并吊销机动车驾驶证。",
      "url": ""
    },
    {
      "id": 942,
      "question": "这辆小型载客汽车驶离高速公路行车道的方法是正确的。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "这个车是按规定驶离高速的，没有问题。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/942.jpg"
    },
    {
      "id": 980,
      "question": "如图所示，驾驶机动车行经该路段时，应减速慢行，避免因眩目导致的交通事故。",
      "answer": "1",
      "item1": "",
      "item2": "",
      "item3": "",
      "item4": "",
      "explains": "该路段为隧道出口，驾驶机动车行经该路段时，应减速慢行，避免因光线突然变化，阳光眩目导致的交通事故。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/980.jpg"
    },
    {
      "id": 986,
      "question": "驾驶机动车遇到这种信号灯，可在对面直行车前直接向左转弯。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "左转让直行。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/986.jpg"
    },
    {
      "id": 990,
      "question": "这个标志是何含义？",
      "answer": "4",
      "item1": "高速公路缴费车道",
      "item2": "高速公路检查车道",
      "item3": "高速公路领卡车道",
      "item4": "高速公路ETC车道",
      "explains": "高速公路ETC车道：用于指示电子不停车收费车道，设在收费广场渐变段起点前300 m处。表示单向3个收费车道时ETC车道指示标志。查看高速公路标志大全：http://www.jszks.com/onepage/16721.html",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/990.jpg"
    },
    {
      "id": 1000,
      "question": "这种白色矩形标线框含义是什么？",
      "answer": "2",
      "item1": "出租车专用上下客停车位",
      "item2": "平行式停车位",
      "item3": "倾斜式停车位",
      "item4": "垂直式停车位",
      "explains": "路边的平行的停车位，亲 侧方停车以后要好好学哦~",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/1000.jpg"
    },
    {
      "id": 1007,
      "question": "驾驶机动车在高速公路上倒车、逆行、穿越中央分隔带掉头的一次记6分。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "驾驶机动车在高速公路上倒车、逆行、穿越中央分隔带掉头的一次记12分。",
      "url": ""
    },
    {
      "id": 1014,
      "question": "机动车驾驶人在实习期内有记满12分记录的，注销其实习的准驾车型驾驶资格。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "规定。",
      "url": ""
    },
    {
      "id": 1038,
      "question": "驶入高速公路的收费口时，应选择怎样的入口？",
      "answer": "3",
      "item1": "车辆多",
      "item2": "红灯亮",
      "item3": "绿灯亮",
      "item4": "暂停服务",
      "explains": "跟红灯停绿灯行一个样，不解释。",
      "url": ""
    },
    {
      "id": 1049,
      "question": "驾驶机动车超车应该提前开启左转向灯、变换使用远近光灯或鸣喇叭。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "这个没有问题。",
      "url": ""
    },
    {
      "id": 1050,
      "question": "在这种环境里行车使用近光灯。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "近光灯不会影响人家的视线。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/1050.jpg"
    },
    {
      "id": 1072,
      "question": "行驶车道绿灯亮时，但车辆前方人行横道仍有行人行走，应怎样做？",
      "answer": "3",
      "item1": "直接起步通过",
      "item2": "起步后从行人后方绕过",
      "item3": "等行人通过后再起步",
      "item4": "起步后从行人前方绕过",
      "explains": "以人为本，安全第一，礼让行人。",
      "url": ""
    },
    {
      "id": 1077,
      "question": "驾驶机动车在高速公路遇到能见度低于100米的气象条件时，最高车速是多少？",
      "answer": "1",
      "item1": "不得超过40公里/小时",
      "item2": "不得超过60公里/小时",
      "item3": "不得超过80公里/小时",
      "item4": "不得超过90公里/小时",
      "explains": "这是规定，没什么好解释的。",
      "url": ""
    },
    {
      "id": 1084,
      "question": "驾驶人发现轮胎漏气，将车辆驶离主车道时，不要采用紧急制动，以免造成翻车或后车采取制动不及时导致追尾事故。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "连续轻踏制动，缓慢将车停下，更换轮胎。",
      "url": ""
    },
    {
      "id": 1112,
      "question": "车辆发生爆胎后，驾驶人在尚未控制住车速前，不要冒险使用行车制动器停车，以避免车辆横甩发生更大的险情。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "行车制动=制动踏板=脚刹，爆胎后，驾驶人在尚未控制住车速的时候，是不能急踩刹车的，要不然会横甩或者翻车已经后面来车追尾。正确的做法应该是紧握方向盘，控制方向，极力保持直线行驶，利用发动机制动，减档或抢档减速度，轻踏制动踏板缓慢减速，平稳靠边停车。请注意试题中的“驾驶人在尚未控制住车速前”此时是不可以使用行车制动器的。",
      "url": ""
    },
    {
      "id": 1117,
      "question": "机动车发生故障时，（如图所示）闪烁。",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "危险报警闪光灯俗称双闪，不会自动闪烁的，这个是要我们驾驶员操作的。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/1117.jpeg"
    },
    {
      "id": 1138,
      "question": "这是什么操纵装置？",
      "answer": "4",
      "item1": "节气门操纵杆",
      "item2": "变速器操纵杆",
      "item3": "离合器操纵杆",
      "item4": "驻车制动器操纵杆",
      "explains": "驻车制动器操纵杆俗称手刹，能使汽车本体固定在地面或某平面上而不出现相对移动的总成的操纵装置。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/1138.jpg"
    },
    {
      "id": 1151,
      "question": "这个导向箭头是何含义？",
      "answer": "1",
      "item1": "提示前方有左弯或需向左合流",
      "item2": "提示前方有右弯或需向右合流",
      "item3": "提示前方右侧有障碍需向左合流",
      "item4": "提示前方有左弯或或许向左绕行",
      "explains": "导向箭头：提示前方道路有左弯或需向左合流。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/1151.jpg"
    },
    {
      "id": 1156,
      "question": "这个标志的含义是指示此处设有室内停车场。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "你看那个P字上边还有个遮挡，说明是室内的，如果没有上边那个遮挡就是露天停车场。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/1156.jpg"
    },
    {
      "id": 1167,
      "question": "这个标志的含义是前方即将行驶至Y型交叉路口？",
      "answer": "2",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "交叉路口：用以警告车辆驾驶人谨慎慢行，注意横向来车。设在平面交叉路口驶入路段的适当位置。",
      "url": "http://images.juheapi.com/jztk/c1c2subject1/1167.jpg"
    },
    {
      "id": 1189,
      "question": "夜间通过没有路灯或路灯照明不良时，应将近光灯转换为远光灯，但同向行驶的后车不得使用远光灯。",
      "answer": "1",
      "item1": "正确",
      "item2": "错误",
      "item3": "",
      "item4": "",
      "explains": "后面如果打远光灯的话，你通过后视镜就什么都看不清了！如果你硬看的话，容易出现短暂失明，很危险！",
      "url": ""
    },
    {
      "id": 1202,
      "question": "驾驶的车辆正在被其他车辆超越时，若此时后方有跟随行驶的车辆，应怎样做？",
      "answer": "2",
      "item1": "继续加速行驶",
      "item2": "稍向右侧行驶，保证横向安全距离",
      "item3": "靠道路中心行驶",
      "item4": "加速向右侧让路",
      "explains": "我们都应该让,安全行驶,一定要和谐。",
      "url": ""
    },
    {
      "id": 1213,
      "question": "同车道行驶的车辆前方遇到下列哪种车辆不得超车？",
      "answer": "1",
      "item1": "执行任务的警车",
      "item2": "大型客货车",
      "item3": "出租汽车",
      "item4": "城市公交车",
      "explains": "如果是真的执行任务的警车（此处不好判断），一定要让行。",
      "url": ""
    }
  ]
}
*/
